Revit 2027 API
ElementArray.ForwardIterator Method
Retrieve a forward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual ElementArrayIterator ForwardIterator()
Public Overridable Function ForwardIterator As ElementArrayIterator
public:
virtual ElementArrayIterator^ ForwardIterator()
abstract ForwardIterator : unit -> ElementArrayIterator
override ForwardIterator : unit -> ElementArrayIterator
Return Value
ElementArrayIterator
Returns a forward moving iterator to the array.
See Also
Reference
ElementArray Class
Autodesk.Revit.DB Namespace